//1. 스폰
const spawnData = { name: "스폰 지점", mcX: -969, mcZ: -965 };

//2. 십이지신
const animals = [
    { order: 1, name: "쥐", mcX: -2900, mcY: 127, mcZ: -4600 },
    { order: 2, name: "소", mcX: -616, mcY: 116, mcZ: 3889 },
    { order: 3, name: "호랑이", mcX: -5500, mcY: 152, mcZ: -1600 },
    { order: 4, name: "토끼", mcX: 4590, mcY: 122, mcZ: -3397 },
    { order: 5, name: "용", mcX: -891, mcY: 106, mcZ: -536 },
    { order: 6, name: "뱀", mcX: 2685, mcY: 145, mcZ: -4051 },
    { order: 7, name: "말", mcX: -2365, mcY: 282, mcZ: 3968 },
    { order: 8, name: "양", mcX: 5093, mcY: 135, mcZ: 2092 },
    { order: 9, name: "원숭이", mcX: 3280, mcY: 162, mcZ: 2952 },
    { order: 10, name: "닭", mcX: 5075, mcY: 106, mcZ: -344 },
    { order: 11, name: "개", mcX: -4455, mcY: 171, mcZ: -2376 },
    { order: 12, name: "돼지", mcX: -3657, mcY: 212, mcZ: 1112 }
];

//3. 광산
const mines = [
    { n: 1, x: -1093, y: 89, z: -701, c: "녹" }, { n: 2, x: -1038, y: 68, z: -14, c: "녹" },
    { n: 3, x: -1837, y: 64, z: -944, c: "녹" }, { n: 4, x: -2599, y: 71, z: -2691, c: "녹" },
    { n: 5, x: -4001, y: 84, z: -1579, c: "녹" }, { n: 6, x: 1085, y: 227, z: 199, c: "녹" },
    { n: 7, x: -775, y: 92, z: -1986, c: "녹" }, { n: 8, x: 2605, y: 81, z: -1142, c: "녹" },
    { n: 9, x: 752, y: 147, z: -1272, c: "녹" }, { n: 10, x: -4322, y: 88, z: -2810, c: "청" },
    { n: 11, x: 815, y: 25, z: 2558, c: "황" }, { n: 12, x: -1913, y: 104, z: 3153, c: "황" },
    { n: 13, x: -3094, y: 24, z: 855, c: "황" }, { n: 14, x: 7137, y: 63, z: -1668, c: "청" },
    { n: 15, x: 6123, y: 95, z: 486, c: "청" }, { n: 16, x: 5709, y: 65, z: -3342, c: "청" },
    { n: 17, x: 3806, y: 75, z: 5436, c: "적" }, { n: 18, x: 3542, y: 74, z: 6378, c: "적" },
    { n: 19, x: -6250, y: 85, z: 2367, c: "적" }, { n: 20, x: -7547, y: 86, z: 623, c: "적" },
    { n: 21, x: -2854, y: 103, z: -5529, c: "청" }, { n: 22, x: -5186, y: 71, z: 1256, c: "청" },
    { n: 23, x: 4301, y: 110, z: -3381, c: "녹" }, { n: 24, x: 5584, y: 78, z: 3322, c: "청" },
    { n: 25, x: 1998, y: 205, z: 4657, c: "적" }, { n: 26, x: 2201, y: 99, z: -2740, c: "녹" },
    { n: 27, x: -6540, y: 79, z: 516, c: "적" }, { n: 28, x: 3701, y: 79, z: 2080, c: "황" },
    { n: 29, x: -4084, y: 70, z: 3035, c: "황" }, { n: 30, x: 6217, y: 89, z: 4562, c: "적" },
    { n: 31, x: -563, y: 74, z: -6176, c: "녹" }, { n: 32, x: 1472, y: 82, z: -6472, c: "녹" },
    { n: 33, x: 4214, y: 74, z: -4596, c: "녹" }, { n: 34, x: 1941, y: 72, z: -5632, c: "녹" },
    { n: 35, x: -4657, y: 71, z: -4523, c: "청" }, { n: 36, x: -4830, y: 74, z: -4303, c: "청" },
    { n: 37, x: -5480, y: 100, z: -1720, c: "청" }, { n: 38, x: -6696, y: 88, z: -1145, c: "적" },
    { n: 39, x: -559, y: 73, z: -4593, c: "녹" }, { n: 40, x: 1487, y: 70, z: 5300, c: "적" },
    { n: 41, x: 1601, y: 78, z: 5485, c: "적" }, { n: 42, x: 2129, y: 74, z: 6598, c: "적" },
    { n: 43, x: -960, y: 82, z: 2033, c: "황" }, { n: 44, x: -2468, y: 195, z: 4433, c: "황" },
    { n: 45, x: -5443, y: 73, z: 4139, c: "적" }, { n: 46, x: 4024, y: 209, z: 3356, c: "적" },
    { n: 47, x: 658, y: 74, z: 3900, c: "황" }, { n: 48, x: -2121, y: 83, z: -3837, c: "녹" },
    { n: 49, x: 4886, y: 89, z: 954, c: "청" }, { n: 50, x: 4942, y: 76, z: -1189, c: "청" },
    { n: 51, x: 677, y: 235, z: 1433, c: "황" }, { n: 52, x: -762, y: 213, z: -6601, c: "녹" },
    { n: 53, x: 2657, y: 75, z: -5891, c: "녹" }, { n: 54, x: 2036, y: 72, z: -3624, c: "녹" },
    { n: 55, x: -4098, y: 75, z: -55, c: "청" }, { n: 56, x: -2006, y: 77, z: 127, c: "녹" },
    { n: 57, x: -2264, y: 81, z: -1571, c: "녹" }, { n: 58, x: 3885, y: 104, z: -1415, c: "녹" },
    { n: 59, x: -5054, y: 80, z: -2598, c: "청" }, { n: 60, x: 3323, y: 67, z: 3939, c: "적" },
    { n: 61, x: 5258, y: 79, z: 5723, c: "적" }, { n: 62, x: 1014, y: 84, z: -2648, c: "녹" },
    { n: 63, x: 2705, y: 80, z: 2461, c: "황" }, { n: 64, x: -4029, y: 134, z: 2321, c: "황" },
    { n: 65, x: -790, y: 109, z: 4284, c: "황" }
];

const mineResources = {
    "녹": "갈옥, 신선옥, 정철광, 청연광, 일옥",
    "청": "청강석, 현철, 한철, 빙옥, 만년한철",
    "황": "오철, 금강석, 정철광",
    "적": "매화옥, 묵철, 혹옥, 청연광, 용린광",
    "공통": "돌덩어리, 철광석, 적동석, 광산초"
};

// 광산별 동선 순서 (데이터 보관용)
const minePaths = {
    "녹": [33, 23, 58, 8, 26, 54, 62, 9, 6, 2, 1, 3, 57, 4, 48, 39, 31, 52, 32, 34, 53, 7, 56, 5],
    "청": [22, 55, 59, 37, 10, 36, 35, 21, 16, 14, 15, 49, 50, 24],
    "황": [29, 64, 13, 43, 12, 44, 65, 47, 11, 51, 63, 28],
    "적": [41, 40, 25, 60, 46, 17, 18, 42, 61, 30, 45, 19, 27, 20, 38]
};

const redItems = [
    { n: 1, x: -3656, y: 78, z: 4060, file: "red1.png" },
    { n: 2, x: -1458, y: 94, z: 2875, file: "red2.png" },
    { n: 3, x: 2358, y: 100, z: 2177, file: "red3.png" },
    { n: 4, x: 2661, y: 72, z: -4790, file: "red4.png" },
    { n: 5, x: 1961, y: 150, z: -6200, file: "red5.png" },
    { n: 6, x: -2579, y: 87, z: -5970, file: "red6.png" },
    { n: 7, x: -3375, y: 100, z: 3449, file: "red7.png" },
    { n: 8, x: 7227, y: 30, z: 764, file: "red8.jpg" },
    { n: 9, x: 15, y: 48, z: 2488, file: "red9.jpg" },
];

// 동상 데이터 (이미지 포함)
const statues = [
    { name: "한월동상", x: -334, y: 255, z: -5519, file: "statue2.png" },
    { name: "제천대성", x: 1513, y: 260, z: 3615, file: "statue3.png" },
    { name: "UNKNOWN", x: 2903, y: 243, z: 714, file: "statue1.png" }
];

// 비석 데이터 (아이콘만)
const mountains = [
    { name: "천보산", x: -2030, y: 80, z: -4142 },
    { name: "망운산", x: -2662, y: 80, z: -1556 },
    { name: "봉래산", x: -5278, y: 80, z: -2042 },
    { name: "신운산", x: -2984, y: 80, z: 72 },
    { name: "월랑산", x: -2720, y: 80, z: 2883 },
    { name: "사성산", x: 4356, y: 80, z: 3515 },
    { name: "용문산", x: 5378, y: 80, z: 3731 },
    { name: "삼악산", x: 5917, y: 80, z: 2453 },
    { name: "도덕산", x: 6498, y: 80, z: 67 },
    { name: "문수산", x: 919, y: 228, z: -734 },
    { name: "고헌산", x: -4137, y: 164, z: -3624 },
    { name: "치마산", x: 6535, y: 248, z: -1207 },
    { name: "축령산", x: 4120, y: 162, z: -844 },
    { name: "방장산", x: 2728, y: 233, z: 383 },
    { name: "문수산", x: 917, y: 227, z: -735 },
    { name: "무량산", x: 4853, y: 256, z: 4970 },
    { name: "척가산", x: -2759, y: 208, z: 1191 },
    { name: "청태산(탁본퀘스트)", x: 4191, y: 80, z: -2806 }
];

// 탐색 데이터
const potItems = [
    { name: "항아리", x: -713, y: 156, z: 2862, item: "고목조각", tool: "탐색부적" },
    { name: "항아리", x: -1758, y: 243, z: -838, item: "송진덩어리", tool: "탐색부적" },
    { name: "항아리", x: 2179, y: 117, z: -529, item: "향목가루", tool: "탐령구" },
    { name: "항아리", x: 5878, y: 154, z: 1155, item: "깨진옥장식", tool: "탐색부적" },
    { name: "항아리", x: -5333, y: 155, z: 673, item: "깨진기와", tool: "탐색부적" },
    { name: "항아리", x: -3784, y: 125, z: -1670, item: "낡은목간", tool: "탐색부적" },
    { name: "항아리", x: -3313, y: 123, z: 3169, item: "청동파편", tool: "탐령구" },
    { name: "항아리", x: 720, y: 150, z: 1800, item: "녹슨철패", tool: "탐령구" },
    { name: "항아리", x: 6426, y: 112, z: 2392, item: "연마사", tool: "탐령구" },
    { name: "항아리", x: -7368, y: 88, z: 1546, item: "잔존영석", tool: "탐령구" },
    { name: "항아리", x: 7268, y: 65, z: 5300, item: "봉인된철편", tool: "탐령구" },
    { name: "항아리", x: 4171, y: 74, z: 2643, item: "마모된인장", tool: "탐령구" }
];

// 의문의 상자 데이터
const mysteryBoxes = [
    { name: "의문의 상자", x: -4818, y: 85, z: -3812, item: "일반부적뽑기" },
    { name: "의문의 상자", x: -6518, y: 89, z: 2366, item: "일반부적뽑기", entrance: "x: -6523, y: 76, z: 2194" },
    { name: "의문의 상자", x: -6761, y: 91, z: 846, item: "고급주문서뽑기" },
    { name: "의문의 상자", x: -3317, y: 122, z: -4255, item: "일반부적뽑기" },
    { name: "의문의 상자", x: 3068, y: 172, z: 6312 },
    { name: "의문의 상자", x: -4395, y: 134, z: 5670 },
    { name: "의문의 상자", x: 5107, y: 211, z: -1998 },
    { name: "의문의 상자", x: 2985, y: 179, z: -980 },
    { name: "의문의 상자", x: -1420, y: 128, z: -4655, item: "일반부적뽑기" },
    { name: "의문의 상자", x: 2984, y: 181, z: -975 },
    { name: "의문의 상자", x: -1852, y: 143, z: 4290 },
    { name: "의문의 상자", x: -4395, y: 134, z: 5670, item: "일반부적뽑기" },
    { name: "의문의 상자", x: 805, y: 250, z: 1784, item: "일반부적뽑기" },
    { name: "의문의 상자", x: 7049, y: 142, z: 2874, item: "고급주문서뽑기" },
    { name: "의문의 상자", x: 5895, y: 119, z: -2180, item: "일반주문서뽑기" },
    { name: "의문의 상자", x: -5177, y: 137, z: -2995, item: "고급주문서뽑기", entrance: "x: -5162, y: 130, z: -2982" },
    { name: "의문의 상자", x: 1124, y: 258, z: 1498, item: "일반부적뽑기"},
    { name: "의문의 상자", x: -6533, y: 93, z: -2603, item: "고급주문서뽑기"},
    { name: "의문의 상자", x: -6579, y: 107, z: 6488, item: "고급주문서뽑기"},
    { name: "의문의 상자", x: -1618, y: 184, z: -2678, item: "고급주문서뽑기", entrance: "가장 꼭대기 폭포 안쪽"},
    { name: "의문의 상자", x: 3089, y: 117, z:-3032, item: "고급주문서뽑기", entrance: "x: 3106, y: 141, z: -3350"},
    { name: "의문의 상자", x: 4336, y: 145, z: 6156, item: "고급주문서뽑기", entrance: "x: 4282, y: 139, z: 6130"},
    { name: "의문의 상자(혈교도 던전 안)", x: -3979, y: 80, z: 2501 }
];

// NPC 데이터

const npcData = [
    { name: "도사", lv: 50, x: -1293, y: 290, z: -598, quest: "[히든]십이지신, [히든]호리병을 찾아서,<br>[히든]심마니", item: "[히든]심마니 : 백향초1개,무공정수20개", route: "[히든]호리병을 찾아서 : 도사 > 도공 > 멸문대(수상한포탈) > 도사", reward: "금환단, 매화초검, 부화검결, 홍매지폭제작서", memo: "", file: "dosa.png" },
    { name: "도공", lv: 50, x: -4778, y: 67, z: 1454, quest: "[히든]호리병을 찾아서", item: "무괴철 1개, 자금 3개", route: "도공 > 멸문대(수상한포탈)", file: "dogong.png" },
    { name: "상단주", lv: 50, x: -3260, y: 123, z: -4287, quest: "[히든]상단주", route: "상단주 > 부숴진마차 > 상단주 > 자운스님 > 상단주", reward: "금환단", file: "owner.png" },
    { name: "부숴진마차", lv: 50, x: -2706, y: 71, z: -2372, quest: "[히든]상단주", route: "부숴진마차 > 자운스님", file: "macha.png" },
    { name: "자운스님", lv: 50, x: -4366, y: 194, z: 1399, quest: "[히든]상단주", item: "향목가루 5개", route: "자운스님 > 상단주", file: "jaun.png" },
    { name: "해진", lv: 50, x: -4310, y: 129, z: 5838, quest: "[히든]해적선", route: "해진 > 해적선(수상한포탈) > 해진 > 백향초재배지 > 해진", reward: "금환단", file: "haejin.png" },
    { name: "해적선", x: -3622, y: 65, z: 4043, quest: "[히든]해적선", route: "훔친백향초찾기 - 수상한포탈 > 해적잡기 > 해진", file: "transparent" }, // 투명 처리용 키워드
    { name: "백향초재배지", x: -5488, y: 66, z: 4162, quest: "[히든]해적선", route: "수상한포탈 > 해진", file: "portal.png" },
    { name: "점소이", x: -2537, y: 79, z: -5994, quest: "???", file: "jumsoi.png" },
    { name: "수습의원", x: -2040, y: 107, z: 171, quest: "???", file: "doctor.png" },
    { name: "다친광부", x: -787, y: 100, z: -1994, quest: "???", item: "녹태", file: "miner.png" },
    { name: "주루대주", x: -2545, y: 79, z: -6022, quest: "???", file: "juru.png" },
    { name: "심마니", lv: 90, x: -3485, y: 80, z: -1950, quest: "[히든]심마니", route: "심마니 > 화검문 > 심마니 > 화검문꼭대기 > 심마니 > 망한 대장장이 > 심마니 > 화검문꼭대기 > 심마니 > 도사 > 제천대성 > 도사 > 매화곡 > 도사 > 서고관리인 > 도사 > 심마니", reward: "금환단,매화쾌검", file: "simmani.png" },
    { name: "척후병", lv: 102, x: -3963, y: 148, z: 2613, quest: "혈교 상자 찾기(절정 승급 이후)", item: "정적주, 빙백설화", records: [ {n:'상자1', x: -3939, y: 13, z: 2045}, {n:'상자2', x: -4097, y: 13, z: 2168}, {n:'상자3', x: -3880, y: -30, z: 2303}], reward: "혈마검법", file: "scout.png" },
    { name: "몰락한소가주", lv:73, x: 3139, y: 78, z: -2583, quest: "망가진보검 <br>[무인의거처] : 2층 침대 클릭시 힘+1</br>", route: "몰락한소가주 > 대장장이 > 명인대장장이 > 소가주 > 부적상점(무공정수10,탐령구3,자운초3개) > 소가주", reward: "금환단, 10만전", file: "sogaju.png" },
    { name: "조사중인스님", x: 391, y: 97, z: -1518, quest: "???", file: "josa.png" },
    { name: "해무사승려", lv: 50, x: -5728, y: 64, z: 3441, quest: "해무사퀘스트:기록서확인(1~6)", file: "haemusa.png", records: [ {n:1, x: -5640, y: 177, z: 3340}, {n:2, x: -5625, y: 149, z: 3332}, {n:3, x: -5555, y: 90, z: 3405}, {n:4, x: -5770, y: 140, z: 3332}, {n:5, x: -5749, y: 124, z: 3215}, {n:6, x: -5578, y: 174, z: 3275}] },
    { name: "연운객", lv: 50, x: -5689, y: 248, z: 3291, quest: "하늘을좇는자", route: "연운객 > 시녀 > 연운객", reward: "창천검법", file: "yeonun.png" },
    { name: "시녀", lv: 50, x: -6538, y: 83, z: -2567, quest: "연운객을 기다리는 사람", file: "girl.png" },
    { 
    name: "명인대장장이", 
    x: -7047, y: 74, z: -727, 
    file: "mungin.png", quest: "부러진보검(몰락한소가주)", item: "백련정강 3개",
    crafting: [
        { name: "송진칠료", materials: "송진덩어리1 + 적동괴1 + 갈옥1 + 돌덩어리2", img: "item1.png"}, 
        { name: "와편분말", materials: "깨진기와1 + 돌덩어리5 + 철1 + 적동석1", img: "item2.png"}, 
        { name: "목심재", materials: "고목조각1 + 철1 + 갈옥1 + 돌덩어리2", img: "item3.png"}, 
        { name: "목판", materials: "낡은목간2 + 강철1 + 송진덩어리2 + 돌덩어리2, <br>확률 : 80%", img: "item4.png"}, 
        { name: "옥장식편", materials: "깨진옥장식2 + 자금1 + 청연광3 + 돌덩어리2, <br>확률 : 80%", img: "item5.png"},  
        { name: "기와문양판", materials: "깨진기와2 + 강철1 + 적동괴1 + 송진덩어리1 + 돌덩어리2, <br>확률 : 80%", img: "item6.png"}, 
        { name: "접합제", materials: "송진칠료1 + 강철2 + 돌덩어리3 + 갈옥1 + 향목가루1, <br>확률 : 60%", img: "item7.png"}, 
        { name: "청동각인판", materials: "와편분말1 + 오금철1 + 청동파편2 + 매화옥1 + 청연광2, <br>확률 : 60% ", img: "item8.png"}, 
        { name: "강화목", materials: "목심재1 + 백련강1 + 신선옥2 + 마모된인장2 + 돌덩어리2, <br>확률 : 60%", img: "item9.png"}, 
        { name: "기문부적", materials: "목판1 + 백련정강1 + 청강석2 + 잔존영석3, <br>확률 : 50%", img: "item10.png"},
        { name: "정련실", materials: "기와문양판1 + 강오금1 + 현철2 + 연마사3, <br>확률 : 50%", img: "item11.png"}, 
        { name: "옥문장식판", materials: "옥장식편1 + 백현철1 + 무괴철1 + 매화옥2 + 봉인된철편3, <br>확률 : 50%", img: "item12.png"}, 
        { name: "한철단조석", materials: "접합제2 + 한철2 + 금강석1 + 연마사2 + 봉인된철편4, <br>확률 : 40%", img: "item13.png"}, 
        { name: "설화정련석", materials: "청동각인판2 + 빙옥5 + 청강석2 + 흑옥4 + 잔존영석4, <br>확률 : 40%", img: "item14.png"}, 
        { name: "금강각인편", materials: "강화목2 + 금강석3 + 깨진옥장식2 + 자금1 + 연마사4, <br>확률 : 40%", img: "item15.png"}
    ]
},
    { name: "망한대장장이", x: 5365, y: 73, z: -3467, quest: "[히든]심마니", item: "은괴 3개, 무괴철 3개", reward: "화검문열쇠", route: "망한대장장이 > 심마니 > 화검문(꼭대기포탈) > 도사", file: "mang.png" },
    { name: "탐령구", x: -2076, y: 221, z: 401, materials: "철1개, 적동괴2개", file: "gu.png"},
    { name: "고대의제작대(정적주)", x: 2035, y: -13, z: 3264, quest: "사도연 : 정적주제작", materials: "1만전, 철1개, 적동괴2개, 송진덩어리", file: "gu2.png"},
    { name: "기록서(사도연)", x: 1539, y: 196, z: 4654, quest: "사도연 : 퀘스트 시작", route: "기록서 > 풍잔객 ", file: "memo.png"},
    { name: "풍잔객", lv: 50, x: 3031, y: 104, z:4286, quest: "사도연 : 바람의목격자", route: "풍잔객 > 정적주제작 > 청풍초 > 풍잔객 > 사도연-검 > 풍잔객", records: [{n : "청풍초", x: 3050, y: 207, z: 4388}, { n: "사도연-검", x: 3081, y: 109, z: 4174}], reward: "초살선풍", file: "pung.png"},
    { name: "감시관", lv: 67, x: 5176, y: 76, z: 4582, quest: "[메인]퀘스트", item: "사보도 1개, 철 3개, 무공정수 10개", file: "gamsi.png" }
];

// 사냥터 데이터

const huntingGrounds = [
    { name: "혈교도", lv: "100", monsters: "혈교도(lv.100)", file: "map15.png", x: -3980, y: 80, z: 2496 },
    { name: "화검문", lv: "90", monsters: "봉원숭이(lv.90), 곤봉원숭이(lv.90)", memo: "*화검문포탈(화검문열쇠) / [히든] 심마니(원숭이 각50마리 사냥)", file: "map16.png", x: -3297, y: 116, z:-1696 },
    { name: "흑운회", lv: "90", monsters: "흑운회무인(lv.90)", memo: "", file: "map17.png", x: 2461, y: 88, z:-1879 },
    { name: "경작지", lv: "0~5", monsters: "참새(lv.0), 허수아비(lv.5)", file: "map1.png", x: -960, y: 67, z: -670 },
    { name: "화수원", lv: "10~20", monsters: "다람쥐(lv.10), 흙토끼(lv.15), 백토끼(lv.20)", file: "map2.png", x: -586, y: 90, z: 443 },
    { name: "괴암곡", lv: "25~35", monsters: "하급쥐(lv.25), 중급쥐(lv30), 상급쥐(lv.35)", memo: "*괴암곡제단 : 장로쥐 소환", file: "map3.png", x: 1310, y: 176, z: -1592 },
    { name: "멸문", lv: "40~50", monsters: "뱀(lv.40), 청사(lv.45), 적사(lv.50)", memo: "*구렁이 출현(파력검법), [히든]호리병을 찾아서(수상한포탈)", records: [{ n:'수상한포탈', x: 3730, y: 129, z: -2591}],  file: "map4.png", x: 3858, y: 131, z: -2642 },
    { name: "신선원", lv: "55~65", monsters: "새싹삼(lv.55), 진삼(lv.60), 대장삼(lv.65)", memo: "*거대삼 출현, *농장주인 소환 포탈", file: "map5.png", x: -3616, y: 244, z: -3096 },
    { name: "천웅성", lv: "70~80", monsters: "비웅(lv70), 겸웅(lv.75), 꼬마유령(lv.80)", file: "map6.png", x: 5706, y: 160, z: 5178 },
    { name: "매화곡", lv: "85~95", monsters: "천도원숭이(lv.85), 황도원숭이(lv.90), 매화호(lv.95)", memo: "*거대 매화호 출현, [히든]심마니 오공 잡기", file: "map7.png", x: 4288, y: 141, z: 408 },
    { name: "이매궁", lv: "100~110", monsters: "도깨비(lv.100), 청깨비(lv.105), 진깨비(lv.110)", file: "map8.png", x: 1634, y: 72, z: 331 },
    { name: "검성지묘", lv: "115~125", monsters: "강암수호(Lv.115), 새끼암갑수(Lv.120), 암갑수(Lv.125)", file: "map9.png", x: -5428, y: 121, z: -808 },
    { name: "빙설곡", lv: "130~140", monsters: "백랑(Lv.130), 적호(Lv.135), 백호(Lv.140)", file: "map10.png", x: 6796, y: 87, z: -2515 },
    { name: "빙궁", lv: "145~155", monsters: "빙궁조(Lv.145), 빙궁병(Lv.150), 북해신녀(Lv.155)", file: "map11.png", x: 6566, y: 83, z: 952  },
    { name: "협사곡", lv: "160~170", monsters: "산적(Lv.160), 산적궁수(Lv.165), 멧돼지산적(Lv.170)", file: "map12.png", x: -242, y: 107, z: 4305 },
    { name: "황야성", lv: "175~185", monsters: "토석병(Lv.175), 토석군(Lv.180), 토석궁사(Lv.185)", file: "map13.png", x: -1985, y: 22, z: 2001 },
    { name: "운해궁", lv: "999", monsters: "???", file: "map14.png", x: -1449, y: 96, z: 5606 }
    ];

// [약초 데이터] 
const herbData = [
    { name: "홍련업화", file: "hub19.png", locations: [{ x: -6842, y: 84, z: 1888 }] },
    { name: "민들레", file: "hub4.png", locations: [{ x: -3006, y: 92, z: -5033 }, { x: 1332, y: 86, z: -6112 }] },
    { name: "옥향초", file: "hub9.png", locations: [{ x: 4800, y: 116, z: 3752 }, { x: 6408, z: 4024 }] },
    { name: "빙백설화", file: "hub16.png", locations: [{ x: 6424, y: 174, z: 136 }] },
    { name: "흑성과", file: "hub14.png", locations: [{ x: -1671, y: 133, z: -3534 }, { x: 1968, y: 124, z: -280 }] },
    { name: "권엽", file: "hub1.png", locations: [{ x: -4496, y: 78, z: -184 }] },
    { name: "생강", file: "hub6.png", locations: [
        { x: 1485, y: 68, z: 3133 }, { x: 1248, y: 108, z: 5784 }, { x: -4656, y: 72, z: 2024 }
    ]},
    { name: "인삼", file: "hub10.png", locations: [{ x: -4705, y:141, z: 765 }, { x: 1500, y: 211, z: 4200 }] },
    { name: "옥취엽", file: "hub8.png", locations: [
        { x: -1323, y: 245, z: -588 }, { x: -3702, y: 118, z: -2388 }, { x: 882, y: 124, z: -2274 }
    ]},
    { name: "황초", file: "hub13.png", locations: [
        { x: 3348, y: 109, z: -4641 }, { x: -3612, y: 92, z: -5616 }, { x: -1444, y: 130, z: -298 }
    ]},
    { name: "녹태", file: "hub3.png", locations: [
        { x: 1110, y: 102, z: -2830 }, { x: -2176, y: 102, z: -187 }, { x: -285, y: 80, z: -1059 }
    ]},
    { name: "철목영지", file: "hub18.png", locations: [{ x: -2304, y: 170, z: 4228 }, { x: -3326, y: 128, z: 3190 }] },
    { name: "적주과", file: "hub12.png", locations: [
        { x: -172, y: 187, z: 2064 }, { x: -3944, y: 241, z: 1272 }, { x: -975, y: 244, z: 766 }
    ]},
    { name: "자운초", file: "hub11.png", locations: [{ x: 2744, y: 224, z: 4672 }, { x: 4034, y: 210, z: 4340 }] },
    { name: "월계엽", file: "hub17.png", locations: [{ x: -96, y: 183, z: -6504 }] },
    { name: "영군버섯", file: "hub7.png", locations: [{ x: 768, y: 101, z: 5056 }, { x: -1712, y: 113, z: -6379 }
    ]},
    { name: "백향초", file: "hub5.png", locations: [{ x: -5488, y: 66, z: 4162 }] },
    { name: "금향과", file: "hub15.png", locations: [{ x: 560, y: 229, z: 1416 }] },
    { name: "금양광초", file: "hub2.png", locations: [{ x: 3236, t: 124, z: 2560 }, { x: 3796, y: 116, z: 1044 }] }
];
// [비급 데이터] 
const skillData = [
    { name: "홍매지폭", info: "부화검결 + 홍련업화 + 철목영지 + 정적주10 + 무공정수50 + 3만전" },
    { name: "혈마검법", info: "파력검법 + 정련실2 + 옥문장식판2 + 설화강철 1 + 무공정수 50 + 3만전" },
    { name: "부화검결", info: "송진덩어리2 + 신선옥15 + 매화옥15 + 옥장식편1 + 백련강1 + 무공정수20 + 3만전" },
    { name: "파력검법", info: "멸문-구렁이 드랍" },
    { name: "열화신공", info: "대장장이불 100개 + 5만전" },
    { name: "흑무검법", info: "필드보스(매화곡) - 오공 드랍" },
    { name: "청무검법", info: "필드보스(신선원) - 농장주인 드랍" },
    { name: "수류검법", info: "탐령구 획득(확정아님, 여러번 시도해야 합니다)", image: "images/where.jpg" },
    { name: "초살선풍", info: "기와문양판1 + 무괴철1 + 갈옥15 + 무공정수30 + 3만전" },
    { name: "빙설검법", info: "도우미NPC - 추천포인트 3으로 교환" },
    { name: "혈사검법", info: "필드보스(검성지묘) - 검성 드랍" },
    { name: "매화초검", info: "목심재 + 옥장식편 + 매화옥20 + 무공정수10 + 3만전" },
    { name: "섬멸검법", info: "단섬검법 + 강철1 + 자금1 + 무공정수20 + 3만전" },
    { name: "천살검법", info: "섬멸검법 + 혈사검법 + 월계엽1 + 한철단조석1 + 기문부적1 + 금강한철 + 10만전" },
    { name: "매화쾌검", info: "매화초검1 + 백현철2 + 강철1 + 기문부적2 + 강화목1 + 무공정수 30 + 3만전" },
    { name: "창천검법", info: "강오금1 + 백현철1 + 청동각인판1 + 청연광20 + 무공정수30 + 3만전" },
    { name: "연검법", info: "튜토리얼 보상" },
    { name: "월섬검법", info: "상점구매 (5,000전)" },
    { name: "단섬검법", info: "상점구매 (5,000전)" },
    { name: "천뢰공", info: "무림맹비급 + 벽력공 + 대장장이의불50 + 금향과1 + 철목영지1 + 무공정수60 + 10만전" },
    { name: "벽력공", info: "토끼내단10 + 1만전" },
    { name: "빙천검법", info: "필드보스(빙설곡) - 설호 드랍" }
];

const blacksmithData = {
    "50제": {
        "방어구": {
            "materials": "적동괴 1개, 오금 1개, 오금철 1개",
            "scrollCount": 3,
            "items": {
                "광설": {
                    "투구": { "스텟": "행운18, 공격력4, 공격력 1%, 체력45, 체력 2%", "일반": "행운14, 공격력3, 체력35", "file": "50lvhelmet1.png" },
                    "갑옷": { "스텟": "힘18, 공격력4, 공격력 1%, 체력45, 체력 2%", "일반": "힘14, 공격력3, 체력35", "file": "50lvarmor1.png" },
                    "허리띠": { "스텟": "생명력18, 공격력4, 공격력 1%, 체력45, 체력 2%", "일반": "생명력14, 공격력3, 체력35", "file": "50lvbelt1.png" },
                    "신발": { "스텟": "민첩18, 공격력4, 공격력 1%, 체력45, 체력 2%", "일반": "민첩14, 공격력3, 체력35", "file": "50lvshoes1.png" }
                },
                "백비": {
                    "투구": { "스텟": "행운16, 공격력3, 공격력1%, 체력40, 체력2%", "일반": "행운12, 공격력2, 체력30", "file": "50lvhelmet2.png" },
                    "갑옷": { "스텟": "힘16, 공격력3, 공격력1%, 체력40, 체력2%", "일반": "힘12, 공격력2, 체력30", "file": "50lvarmor2.png" },
                    "허리띠": { "스텟": "생명력16, 공격력3, 공격력1%, 체력40, 체력2%", "일반": "생명력12, 공격력2, 체력30", "file": "50lvbelt2.png" },
                    "신발": { "스텟": "민첩16, 공격력3, 공격력1%, 체력40, 체력2%", "일반": "민첩12, 공격력2, 체력30", "file": "50lvshoes2.png" }
                },
                "광전": {
                    "투구": { "스텟": "행운14, 공격력3, 공격력1%, 체력35, 체력2%", "일반": "행운10, 공격력2, 체력25", "file": "50lvhelmet3.png" },
                    "갑옷": { "스텟": "힘14, 공격력3, 공격력1%, 체력35, 체력2%", "일반": "힘10, 공격력2, 체력25", "file": "50lvarmor3.png" },
                    "허리띠": { "스텟": "생명력14, 공격력3, 공격력1%, 체력35, 체력2%", "일반": "생명력10, 공격력2, 체력25", "file": "50lvbelt3.png" },
                    "신발": { "스텟": "민첩14, 공격력3, 공격력1%, 체력35, 체력2%", "일반": "민첩10, 공격력2, 체력25", "file": "50lvshoes3.png" }
                },
                "투해": {
                    "투구": { "스텟": "행운12, 공격력2, 공격력1%, 체력30, 체력2%", "일반": "행운8, 공격력1, 체력20", "file": "50lvhelmet4.png" },
                    "갑옷": { "스텟": "힘12, 공격력2, 공격력1%, 체력30, 체력2%", "일반": "힘8, 공격력1, 체력20", "file": "50lvarmor4.png" },
                    "허리띠": { "스텟": "생명력12, 공격력2, 공격력1%, 체력30, 체력2%", "일반": "생명력8, 공격력1, 체력20", "file": "50lvbelt4.png" },
                    "신발": { "스텟": "민첩12, 공격력2, 공격력1%, 체력30, 체력2%", "일반": "민첩8, 공격력1, 체력20", "file": "50lvshoes4.png" }
                },
                "동군": {
                    "투구": { "스텟": "행운10, 공격력2, 공격력1%, 체력25, 체력2%", "일반": "행운6, 공격력1, 체력15", "file": "50lvhelmet5.png" },
                    "갑옷": { "스텟": "힘10, 공격력2, 공격력1%, 체력25, 체력2%", "일반": "힘6, 공격력1, 체력15", "file": "50lvarmor5.png" },
                    "허리띠": { "스텟": "생명력10, 공격력2, 공격력1%, 체력25, 체력 2%", "일반": "생명력6, 공격력1, 체력15", "file": "50lvbelt5.png" },
                    "신발": { "스텟": "민첩10, 공격력2, 공격력1%, 체력25, 체력 2%", "일반": "민첩6, 공격력1, 체력15", "file": "50lvshoes5.png" }
                }
            }
        },
        "무기": {
            "materials": "철 1개, 백련강 1개, 오금철 1개, 강철 1개",
            "scrollCount": 4,
            "items": {
                "흑귀도": { "스텟": "공격력83, 최종공격력1.8%, 스킬피해량1.6%, 치명타1%", "일반": "공격력76, 최종공격력1.8%", "file": "50lv1.png" },
                "사월검": { "스텟": "공격력79, 최종공격력1.6%, 스킬피해량1.5%, 치명타1%", "일반": "공격력72, 최종공격력1.6%", "file": "50lv2.png" },
                "녹태도": { "스텟": "공격력74, 최종공격력1.4%, 스킬피해량1.4%, 치명타1%", "일반": "공격력68, 최종공격력1.4%", "file": "50lv3.png" },
                "사보도": { "스텟": "공격력70, 최종공격력1.2%, 스킬피해량1.3%, 치명타1%", "일반": "공격력64, 최종공격력1.2%", "file": "50lv4.png" },
                "연화도": { "스텟": "공격력66, 최종공격력1%, 스킬피해량1.2% 치명타1%", "일반": "공격력60, 최종공격력1%", "file": "50lv5.png" }
            }
        }
    },
    "80제": {
        "방어구": {
            "materials": "오금철 1개, 자금 1개, 강오금 1개",
            "scrollCount": 4,
            "items": {
                "금군": {
                    "투구": { "스텟": "행운28, 공격력7, 공격력1%, 체력70, 체력2%", "일반": "행운24, 공격력6, 체력60", "file": "80lvhelmet1.png" },
                    "갑옷": { "스텟": "힘28, 공격력7, 공격력1%, 체력70, 체력2%", "일반": "힘24, 공격력6, 체력60", "file": "80lvarmor1.png" },
                    "허리띠": { "스텟": "생명력28, 공격력7, 공격력1%, 체력70, 체력2%", "일반": "생명력24, 공격력6, 체력60", "file": "80lvbelt1.png" },
                    "신발": { "스텟": "민첩28, 공격력7, 공격력1%, 체력70, 체력2%", "일반": "민첩24, 공격력6, 체력60", "file": "80lvshoes1.png" }
                },
                "장현": {
                    "투구": { "스텟": "행운26, 공격력6, 공격력1%, 체력65, 체력2%", "일반": "행운22, 공격력5, 체력55", "file": "80lvhelmet2.png" },
                    "갑옷": { "스텟": "힘26, 공격력6, 공격력1%, 체력65, 체력2%", "일반": "힘22, 공격력5, 체력55", "file": "80lvarmor2.png" },
                    "허리띠": { "스텟": "생명력26, 공격력6, 공격력1%, 체력65, 체력2%", "일반": "생명력22, 공격력5, 체력55", "file": "80lvbelt2.png" },
                    "신발": { "스텟": "민첩26, 공격력6, 공격력1%, 체력65, 체력2%", "일반": "민첩22, 공격력5, 체력55", "file": "80lvshoes2.png" }
                },
                "청군": {
                    "투구": { "스텟": "행운24, 공격력6, 공격력1%, 체력60, 체력2%", "일반": "행운20, 공격력5, 체력50", "file": "80lvhelmet3.png" },
                    "갑옷": { "스텟": "힘24, 공격력6, 공격력1%, 체력60, 체력2%", "일반": "힘20, 공격력5, 체력50", "file": "80lvarmor3.png" },
                    "허리띠": { "스텟": "생명력24, 공격력6, 공격력1%, 체력60, 체력2%", "일반": "생명력20, 공격력5, 체력50", "file": "80lvbelt3.png" },
                    "신발": { "스텟": "민첩24, 공격력6, 공격력1%, 체력60, 체력2%", "일반": "민첩20, 공격력5, 체력50", "file": "80lvshoes3.png" }
                },
                "백현": {
                    "투구": { "스텟": "행운22, 공격력5, 공격력1%, 체력55, 체력2%", "일반": "행운18, 공격력4, 체력45", "file": "80lvhelmet4.png" },
                    "갑옷": { "스텟": "힘22, 공격력5, 공격력1%, 체력55, 체력2%", "일반": "힘18, 공격력4, 체력45", "file": "80lvarmor4.png" },
                    "허리띠": { "스텟": "생명력22, 공격력5, 공격력1%, 체력55, 체력2%", "일반": "생명력18, 공격력4, 체력45", "file": "80lvbelt4.png" },
                    "신발": { "스텟": "민첩22, 공격력5, 공격력1%, 체력55, 체력2%", "일반": "민첩18, 공격력4, 체력45", "file": "80lvshoes4.png" }
                },
                "호군": {
                    "투구": { "스텟": "행운20, 공격력5, 공격력1%, 체력50, 체력2%", "일반": "행운16, 공격력4, 체력40", "file": "80lvhelmet5.png" },
                    "갑옷": { "스텟": "힘20, 공격력5, 공격력1%, 체력50, 체력2%", "일반": "힘16, 공격력4, 체력40", "file": "80lvarmor5.png" },
                    "허리띠": { "스텟": "생명력20, 공격력5, 공격력1%, 체력50, 체력2%", "일반": "생명력16, 공격력4, 체력40", "file": "80lvbelt5.png" },
                    "신발": { "스텟": "민첩20, 공격력5, 공격력1%, 체력50, 체력2%", "일반": "민첩16, 공격력4, 체력40", "file": "80lvshoes5.png" }
                }
            }
        },
        "무기": {
            "materials": "백련강 1개, 무괴철 1개, 적동괴 1개, 현철 3개",
            "scrollCount": 5,
            "items": {
                "홍련검": { "스텟": "공격력127, 최종공격력2.8%, 스킬피해량2.1%, 치명타확률1%", "일반": "공격력116, 최종공격력2.8%", "file": "80lv1.png" },
                "청월검": { "스텟": "공격력123, 최종공격력2.6%, 스킬피해량2%, 치명타확률1%", "일반": "공격력112, 최종공격력2.6%", "file": "80lv2.png" },
                "흑월검": { "스텟": "공격력118, 최종공격력2.4%, 스킬피해량1.9%, 치명타확률1%", "일반": "공격력108, 최종공격력2.4%", "file": "80lv3.png" },
                "화연도": { "스텟": "공격력114, 최종공격력2.2%, 스킬피해량1.8%, 치명타확률1%", "일반": "공격력104, 최종공격력2.2%", "file": "80lv4.png" },
                "화염사검": { "스텟": "공격력110, 최종공격력2%, 스킬피해량1.7%, 치명타확률1%", "일반": "공격력104, 최종공격력2.2%", "file": "80lv5.png" }
            }
        }
    },
    "110제": {
        "방어구": {
            "materials": "강오금 1개, 백현철 1개, 무괴철 1개",
            "scrollCount": 5,
            "items": {
                "염화": {
                    "투구": { "스텟": "행운38, 공격력10, 공격력1%, 체력95, 체력2%", "일반": "행운34, 공격력9, 체력85", "file": "110lvhelmet1.png" },
                    "갑옷": { "스텟": "힘38, 공격력10, 공격력1%, 체력95, 체력2%", "일반": "힘34, 공격력9, 체력85", "file": "110lvarmor1.png" },
                    "허리띠": { "스텟": "생명력38, 공격력10, 공격력1%, 체력95, 체력2%", "일반": "생명력34, 공격력9, 체력85", "file": "110lvbelt1.png" },
                    "신발": { "스텟": "민첩38, 공격력10, 공격력1%, 체력95, 체력2%", "일반": "민첩34, 공격력9, 체력85", "file": "110lvshoes1.png" }
                },
                "금청": {
                    "투구": { "스텟": "행운36, 공격력9, 공격력1%, 체력90, 체력2%", "일반": "행운32, 공격력8, 체력80", "file": "110lvhelmet2.png" },
                    "갑옷": { "스텟": "힘36, 공격력9, 공격력1%, 체력90, 체력2%", "일반": "힘32, 공격력8, 체력80", "file": "110lvarmor2.png" },
                    "허리띠": { "스텟": "생명력36, 공격력9, 공격력1%, 체력90, 체력2%", "일반": "생명력32, 공격력8, 체력80", "file": "110lvbelt2.png" },
                    "신발": { "스텟": "민첩36, 공격력9, 공격력1%, 체력90, 체력2%", "일반": "민첩32, 공격력8, 체력80", "file": "110lvshoes2.png" }
                },
                "금투": {
                    "투구": { "스텟": "행운34, 공격력9, 공격력1%, 체력85, 체력2%", "일반": "행운30, 공격력8, 체력75", "file": "110lvhelmet3.png" },
                    "갑옷": { "스텟": "힘34, 공격력9, 공격력1%, 체력85, 체력2%", "일반": "힘30, 공격력8, 체력75", "file": "110lvarmor3.png" },
                    "허리띠": { "스텟": "생명력34, 공격력9, 공격력1%, 체력85, 체력2%", "일반": "생명력30, 공격력8, 체력75", "file": "110lvbelt3.png" },
                    "신발": { "스텟": "민첩34, 공격력9, 공격력1%, 체력85, 체력2%", "일반": "민첩30, 공격력8, 체력75", "file": "110lvshoes3.png" }
                },
                "녹귀": {
                    "투구": { "스텟": "행운32, 공격력8, 공격력1%, 체력80, 체력2%", "일반": "행운28, 공격력7, 체력70", "file": "110lvhelmet4.png" },
                    "갑옷": { "스텟": "힘32, 공격력8, 공격력1%, 체력80, 체력2%", "일반": "힘28, 공격력7, 체력70", "file": "110lvarmor4.png" },
                    "허리띠": { "스텟": "생명력32, 공격력8, 공격력1%, 체력80, 체력2%", "일반": "생명력28, 공격력7, 체력70", "file": "110lvbelt4.png" },
                    "신발": { "스텟": "민첩32, 공격력8, 공격력1%, 체력80, 체력2%", "일반": "민첩28, 공격력7, 체력70", "file": "110lvshoes4.png" }
                },
                "진무": {
                    "투구": { "스텟": "행운30, 공격력8, 공격력1%, 체력75, 체력2%", "일반": "행운26, 공격력7, 체력65", "file": "110lvhelmet5.png" },
                    "갑옷": { "스텟": "힘30, 공격력8, 공격력1%, 체력75, 체력2%", "일반": "힘26, 공격력7, 체력65", "file": "110lvarmor5.png" },
                    "허리띠": { "스텟": "생명력30, 공격력8, 공격력1%, 체력75, 체력2%", "일반": "생명력26, 공격력7, 체력65", "file": "110lvbelt5.png" },
                    "신발": { "스텟": "민첩30, 공격력8, 공격력1%, 체력75, 체력2%", "일반": "민첩26, 공격력7, 체력65", "file": "110lvshoes5.png" }
                }
             }
        },
        "무기": {
            "materials": "강오금 1개, 백현철 1개, 백련정강 1개, 강철 1개",
            "scrollCount": 6,
            "items": {
                "황금도": { "스텟": "공격력160, 최종공격력3.8%, 스킬피해량2.6%, 치명타확률 1%", "일반": "공격력146, 최종공격력3.8%", "file": "110lv1.png" },
                "은룡사검": { "스텟": "공격력156, 최종공격력3.6%, 스킬피해량2.5%, 치명타확률 1%", "일반": "공격력142, 최종공격력3.6%", "file": "110lv2.png" },
                "무네치카": { "스텟": "공격력151, 최종공격력3.4%, 스킬피해량2.4%, 치명타확률 1%", "일반": "공격력138, 최종공격력3.4%", "file": "110lv3.png" },
                "무라마사": { "스텟": "공격력147, 최종공격력3.2%, 스킬피해량2.3%, 치명타확률 1%", "일반": "공격력134, 최종공격력3.2%", "file": "110lv4.png" },
                "백혈도": { "스텟": "공격력143, 최종공격력3%, 스킬피해량2.2%, 치명타확률 1%", "일반": "공격력130, 최종공격력3%", "file": "110lv5.png" }
            }
        }
    },
    "150제": {
        "방어구": {
            "materials": "설화오금 1개, 무괴철 1개, 강오금 1개, 백현철 1개",
            "scrollCount": 6,
            "items": {
                "산령": {
                    "투구": { "스텟": "행운48, 공격력13, 공격력1%, 체력120, 체력2%", "일반": "행운44, 공격력12, 체력110", "file": "150lvhelmet1.png" },
                    "갑옷": { "스텟": "힘48, 공격력13, 공격력1%, 체력120, 체력2%", "일반": "힘44, 공격력12, 체력110", "file": "150lvarmor1.png" },
                    "허리띠": { "스텟": "생명력48, 공격력13, 공격력1%, 체력120, 체력2%", "일반": "생명력44, 공격력12, 체력110", "file": "150lvbelt1.png" },
                    "신발": { "스텟": "민첩48, 공격력13, 공격력1%, 체력120, 체력2%", "일반": "민첩44, 공격력12, 체력110", "file": "150lvshoes1.png" }
                },
                "진군": {
                    "투구": { "스텟": "행운46, 공격력12, 공격력1%, 체력115, 체력2%", "일반": "행운42, 공격력11, 체력105", "file": "150lvhelmet2.png" },
                    "갑옷": { "스텟": "힘46, 공격력12, 공격력1%, 체력115, 체력2%", "일반": "힘42, 공격력11, 체력105", "file": "150lvarmor2.png" },
                    "허리띠": { "스텟": "생명력46, 공격력12, 공격력1%, 체력115, 체력2%", "일반": "생명력42, 공격력11, 체력105", "file": "150lvbelt2.png" },
                    "신발": { "스텟": "민첩46, 공격력12, 공격력1%, 체력115, 체력2%", "일반": "민첩42, 공격력11, 체력105", "file": "150lvshoes2.png" }
                },
                "투령": {
                    "투구": { "스텟": "행운44, 공격력12, 공격력1%, 체력110, 체력2%", "일반": "행운40, 공격력11, 체력100", "file": "150lvhelmet3.png" },
                    "갑옷": { "스텟": "힘44, 공격력12, 공격력1%, 체력110, 체력2%", "일반": "힘40, 공격력11, 체력100", "file": "150lvarmor3.png" },
                    "허리띠": { "스텟": "생명력44, 공격력12, 공격력1%, 체력110, 체력2%", "일반": "생명력40, 공격력11, 체력100", "file": "150lvbelt3.png" },
                    "신발": { "스텟": "민첩44, 공격력12, 공격력1%, 체력110, 체력2%", "일반": "민첩40, 공격력11, 체력100", "file": "150lvshoes3.png" }
                },
                "적령": {
                    "투구": { "스텟": "행운42, 공격력11, 공격력1%, 체력105, 체력2%", "일반": "행운38, 공격력10, 체력95", "file": "150lvhelmet4.png" },
                    "갑옷": { "스텟": "힘42, 공격력11, 공격력1%, 체력105, 체력2%", "일반": "힘38, 공격력10, 체력95", "file": "150lvarmor4.png" },
                    "허리띠": { "스텟": "생명력42, 공격력11, 공격력1%, 체력105, 체력2%", "일반": "생명력38, 공격력10, 체력95", "file": "150lvbelt4.png" },
                    "신발": { "스텟": "민첩42, 공격력11, 공격력1%, 체력105, 체력2%", "일반": "민첩38, 공격력10, 체력95", "file": "150lvshoes4.png" }
                },
                "괴록": {
                    "투구": { "스텟": "행운40, 공격력11, 공격력1%, 체력100, 체력2%", "일반": "행운36, 공격력10, 체력90", "file": "150lvhelmet5.png" },
                    "갑옷": { "스텟": "힘40, 공격력11, 공격력1%, 체력100, 체력2%", "일반": "힘36, 공격력10, 체력90", "file": "150lvarmor5.png" },
                    "허리띠": { "스텟": "생명력40, 공격력11, 공격력1%, 체력100, 체력2%", "일반": "생명력36, 공격력10, 체력90", "file": "150lvbelt5.png" },
                    "신발": { "스텟": "민첩40, 공격력11, 공격력1%, 체력100, 체력2%", "일반": "민첩36, 공격력10, 체력90", "file": "150lvshoes5.png" }
                }
            }
        },
        "무기": {
            "materials": "설화강철 1개, 오금한철 1개, 강오금 1개, 백현철 1개, 백련정강 1개",
            "scrollCount": 7,
            "items": {
                "이매귀도": { "스텟": "공격력 193, 최종공격력 4.8%, 스킬피해량 3.1%, 치명타확률 1%", "일반": "공격력 176, 최종공격력 4.8%", "file": "150lv1.png" },
                "빙각룡": { "스텟": "공격력 189, 최종공격력 4.6%, 스킬피해량 3%, 치명타확률 1%", "일반": "공격력 172, 최종공격력 4.6%", "file": "150lv2.png" },
                "백룡검": { "스텟": "공격력 184, 최종공격력 4.4%, 스킬피해량 2.9%, 치명타확률 1%", "일반": "공격력 168, 최종공격력 4.4%", "file": "150lv3.png" },
                "창룡검": { "스텟": "공격력 180, 최종공격력 4.2%, 스킬피해량 2.8%, 치명타확률 1%", "일반": "공격력 164, 최종공격력 4.2%", "file": "150lv4.png" },
                "귀매도": { "스텟": "공격력 176, 최종공격력 4%, 스킬피해량 2.7, 치명타확률 1%", "일반": "공격력 160, 최종공격력 4%", "file": "150lv5.png" }
            }
        }
    },
    "180제": {
        "방어구": {
            "materials": "일광용린 1개, 설화강철 1개, 설화오금 1개, 오금한철 1개",
            "scrollCount": 7,
            "items": {
                "금성": {
                    "투구": { "스텟": "행운58, 공격력16, 공격력1%, 체력145, 체력2%", "일반": "행운54, 공격력15, 체력135", "file": "180lvhelmet1.png" },
                    "갑옷": { "스텟": "힘58, 공격력16, 공격력1%, 체력145, 체력2%", "일반": "힘54, 공격력15, 체력135", "file": "180lvarmor1.png" },
                    "허리띠": { "스텟": "생명력58, 공격력16, 공격력1%, 체력145, 체력2%", "일반": "생명력54, 공격력15, 체력135", "file": "180lvbelt1.png" },
                    "신발": { "스텟": "민첩58, 공격력16, 공격력1%, 체력145, 체력2%", "일반": "민첩54, 공격력15, 체력135", "file": "180lvshoes1.png" }
                },
                "괴황": {
                    "투구": { "스텟": "행운56, 공격력15, 공격력1%, 체력140, 체력2%", "일반": "행운52, 공격력14, 체력130", "file": "180lvhelmet2.png" },
                    "갑옷": { "스텟": "힘56, 공격력15, 공격력1%, 체력140, 체력2%", "일반": "힘52, 공격력14, 체력130", "file": "180lvarmor2.png" },
                    "허리띠": { "스텟": "생명력56, 공격력15, 공격력1%, 체력140, 체력2%", "일반": "생명력52, 공격력14, 체력130", "file": "180lvbelt2.png" },
                    "신발": { "스텟": "민첩56, 공격력15, 공격력1%, 체력140, 체력2%", "일반": "민첩52, 공격력14, 체력130", "file": "180lvshoes2.png" }
                },
                "청귀": {
                    "투구": { "스텟": "행운54, 공격력15, 공격력1%, 체력135, 체력2%", "일반": "행운50, 공격력14, 체력125", "file": "180lvhelmet3.png" },
                    "갑옷": { "스텟": "힘54, 공격력15, 공격력1%, 체력135, 체력2%", "일반": "힘50, 공격력14, 체력125", "file": "180lvarmor3.png" },
                    "허리띠": { "스텟": "생명력54, 공격력15, 공격력1%, 체력135, 체력2%", "일반": "생명력50, 공격력14, 체력125", "file": "180lvbelt3.png" },
                    "신발": { "스텟": "민첩54, 공격력15, 공격력1%, 체력135, 체력2%", "일반": "민첩50, 공격력14, 체력125", "file": "180lvshoes3.png" }
                },
                "천군": {
                    "투구": { "스텟": "행운52, 공격력14, 공격력1%, 체력130, 체력2%", "일반": "행운48, 공격력13, 체력120", "file": "180lvhelmet4.png" },
                    "갑옷": { "스텟": "힘52, 공격력14, 공격력1%, 체력130, 체력2%", "일반": "힘48, 공격력13, 체력120", "file": "180lvarmor4.png" },
                    "허리띠": { "스텟": "생명력52, 공격력14, 공격력1%, 체력130, 체력2%", "일반": "생명력48, 공격력13, 체력120", "file": "180lvbelt4.png" },
                    "신발": { "스텟": "민첩52, 공격력14, 공격력1%, 체력130, 체력2%", "일반": "민첩48, 공격력13, 체력120", "file": "180lvshoes4.png" }
                },
                "광룡": {
                    "투구": { "스텟": "행운50, 공격력14, 공격력1%, 체력125, 체력2%", "일반": "행운46, 공격력13, 체력115", "file": "180lvhelmet5.png" },
                    "갑옷": { "스텟": "힘50, 공격력14, 공격력1%, 체력125, 체력2%", "일반": "힘46, 공격력13, 체력115", "file": "180lvarmor5.png" },
                    "허리띠": { "스텟": "생명력50, 공격력14, 공격력1%, 체력125, 체력2%", "일반": "생명력46, 공격력13, 체력115", "file": "180lvbelt5.png" },
                    "신발": { "스텟": "민첩50, 공격력14, 공격력1%, 체력125, 체력2%", "일반": "민첩46, 공격력13, 체력115", "file": "180lvshoes5.png" }
                }
            }
        },
        "무기": {
            "materials": "금강한철 1개, 설화강철 1개, 설화오금 1개, 오금한철 1개",
            "scrollCount": 7,
            "items": {
                "화염마검": { "스텟": "공격력 244, 최종공격력 5.8%, 스킬피해량 3.6%, 치명타확률 1%", "일반": "공격력 222, 최종공격력 5.8%", "file": "180lv1.png" },
                "청산소천도": { "스텟": "공격력 239, 최종공격력 5.6%, 스킬피해량 3.5%, 치명타확률 1%", "일반": "공격력 218, 최종공격력 5.6%", "file": "180lv2.png" },
                "흑왕대검": { "스텟": "공격력 235, 최종공격력 5.4%, 스킬피해량 3.4%, 치명타확률 1%", "일반": "공격력 214, 최종공격력 5.4%", "file": "180lv3.png" },
                "황룡대도": { "스텟": "공격력 231, 최종공격력 5.2%, 스킬피해량 3.3%, 치명타확률 1%", "일반": "공격력 210, 최종공격력 5.2%", "file": "180lv4.png" },
                "절영귀도": { "스텟": "공격력 198, 최종공격력 5%, 스킬피해량 3.2%, 치명타확률 1%", "일반": "공격력 180, 최종공격력 5%", "file": "180lv5.png" }
            }
        }
    },
    "장신구": {
        "반지": {
            "30제": { "금제반지": { "스텟": "체력 50", "file": "ring1.png" } },
            "70제": { 
                "황금반지": { "스텟": "민첩 3%, 체력 2%", "file": "ring2.png" },
                "화심반지": { "스텟": "힘 3%, 체력 2%", "file": "ring3.png" },
                "금신반지": { "스텟": "생명력 5, 생명력 3%, 스킬피해량 1%, 체력 2%, 회피 1%", "file": "ring5.png" },
                "마군반지": { "스텟": "행운 5, 행운 3%, 스킬피해량 1%, 체력 2%, 회피 1%", "file": "ring4.png" }
            },
            "100제": { "금성반지": { "스텟": "저항 10%, 경험치획득량 3%, 드랍률 3%, 물약회복량 10%", "file": "ring6.png" } },
            "105제": { "흑무반지": { "스텟": "공격력 10, 공격력 3%, 보스공격력 7%, 스킬속도 1%", "file": "ring7.png" } },
            "120제": { "청룡반지": { "스텟": "힘 5%, 체력 4%", "file": "ring8.png" } }
        },
        "귀걸이": {
            "50제": {
                "취옥귀걸이": { "스텟": "보스공격력 1-12%, 체력 1-50, 체력 1-15%, 저항 1-10%, 스킬속도 1-3%", "file": "ear1.png" },
                "연화귀걸이": { "스텟": "공격력 1-20, 스킬피해량 1-5%, 체력 1-50, 스킬속도 1-3%", "file": "ear2.png" },
                "조복귀걸이": { "스텟": "체력 1-50, 경험치획득량 1-8%, 드랍률 1-8%, 스킬속도 1-3%, 물약회복량 1-10%", "file": "ear3.png" }
            },
            "110제": { "금귀걸이": { "스텟": "보스공격력 % , 체력 , 힘 % , 체력 % , 저항 % , 스킬속도 % , 치명타확률 %", "file": "ear4.png" } }
        }
    }
};
    
// [영단 데이터]
// 황환단, 힘+2, 민첩+2, 생명력+2, 행운+2, 우물 영단 상자
// 녹환단, 힘(%)+1, 생명력(%)+1, 우물 영단 상자
// 자환단, 민첩(%)+1, 행운(%)+1, 출석 7일 보상
// 청환단, 공격력(%)+3, 보스공격력(%)+1, 대장장이의불 100개 교환
// 적환단, 체력+15, 체력(%)+1, 탐험(?)
// 백환단, 경험치(%)+1, 드랍률(%)+1, 탐색
// 적환단
// 백환단
// 흑환단, 저항(%)+3, 물약회복량(%)+3, 미확인
// 옥환단, 공격력(%)+1, 해상 포인트 교환
// 은환단, 최종공격력(%)+1, 레이드보상
// 금환단, 스킬피해량(%)+1, 레벨보상, 히든퀘스트
